In [2]:
import pandas as pd
import numpy as np

In [3]:
data={'name': ["harsh", "N/A",'varun','N/A' , 'N/A'] , 'age' :[22,21,"?",45,32]}

In [4]:
df=pd.DataFrame(data)

In [5]:
df

    name age
0  harsh  22
1    N/A  21
2  varun   ?
3    N/A  45
4    N/A  32

In [6]:
a=df.where(df!='N/A',  np.nan)

In [7]:
c=a.where(df!='?',  np.nan)

In [8]:
c

    name  age
0  harsh   22
1    NaN   21
2  varun  NaN
3    NaN   45
4    NaN   32

In [9]:
drop_col=c.isnull().sum() *100/len(c)

In [10]:
drop_col

name    60.0
age     20.0
dtype: float64

In [11]:
to_drop = drop_col[drop_col>50].index
to_drop

Index(['name'], dtype='object')

In [12]:
d=c.drop(columns=to_drop)

In [13]:
mean_value= d['age'].mean()

In [14]:
d.fillna(mean_value)

    age
0  22.0
1  21.0
2  30.0
3  45.0
4  32.0

In [290]:
data = {'col1': [1, 2, 'N/A', 4, 5, '?', 7, 8, np.nan, 10],
        'col2': ['A', 'B', 'C', 'N/A', 'E', 'F', '?', 'H', 'I', 'J'],
        'col3': [100, 200, 300, 400, 500, '?', 700, 'N/A', 900, 1000],
        'col4': [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, 7, 8, 9, 10], # >50% nulls
        'col5': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', np.nan],
        'col6': [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan] # All nulls
       }
df = pd.DataFrame(data)

In [291]:
df

  col1 col2  col3  col4 col5  col6
0    1    A   100   NaN    X   NaN
1    2    B   200   NaN    Y   NaN
2  N/A    C   300   NaN    Z   NaN
3    4  N/A   400   NaN    X   NaN
4    5    E   500   NaN    Y   NaN
5    ?    F     ?   NaN    Z   NaN
6    7    ?   700   7.0    X   NaN
7    8    H   N/A   8.0    Y   NaN
8  NaN    I   900   9.0    Z   NaN
9   10    J  1000  10.0  NaN   NaN

In [292]:
a=df.replace(["N/A", "?"] , np.nan)

In [293]:
to_drop= a.isnull().sum() * 100/len(df)

In [294]:
to_drop

col1     30.0
col2     20.0
col3     20.0
col4     60.0
col5     10.0
col6    100.0
dtype: float64

In [295]:
more50 = to_drop[to_drop>50].index

In [296]:
more50

Index(['col4', 'col6'], dtype='object')

In [297]:
b=a.drop(columns=more50)

In [298]:
b

   col1 col2    col3 col5
0   1.0    A   100.0    X
1   2.0    B   200.0    Y
2   NaN    C   300.0    Z
3   4.0  NaN   400.0    X
4   5.0    E   500.0    Y
5   NaN    F     NaN    Z
6   7.0  NaN   700.0    X
7   8.0    H     NaN    Y
8   NaN    I   900.0    Z
9  10.0    J  1000.0  NaN

In [299]:
numeric=b.select_dtypes(include="number")

In [300]:
character=b.select_dtypes(include="object")

In [301]:
numeric

   col1    col3
0   1.0   100.0
1   2.0   200.0
2   NaN   300.0
3   4.0   400.0
4   5.0   500.0
5   NaN     NaN
6   7.0   700.0
7   8.0     NaN
8   NaN   900.0
9  10.0  1000.0

In [302]:
character

  col2 col5
0    A    X
1    B    Y
2    C    Z
3  NaN    X
4    E    Y
5    F    Z
6  NaN    X
7    H    Y
8    I    Z
9    J  NaN

In [303]:
num_mean= numeric.mean()

In [304]:
num_mean

col1      5.285714
col3    512.500000
dtype: float64

In [305]:
d=numeric.replace(np.nan,num_mean)

In [306]:
character

  col2 col5
0    A    X
1    B    Y
2    C    Z
3  NaN    X
4    E    Y
5    F    Z
6  NaN    X
7    H    Y
8    I    Z
9    J  NaN

In [316]:
mode_val = character['col2'].mode()[0]
mode_val2 = character['col5'].mode()[0]

In [317]:
mode_val

'A'

In [318]:
mode_val2

'X'

In [319]:
character.replace(np.nan , mode_val)
c=character.replace(np.nan , mode_val2)

In [320]:
combined_df = pd.concat([d,c], axis=1)

In [321]:
combined_df

        col1    col3 col2 col5
0   1.000000   100.0    A    X
1   2.000000   200.0    B    Y
2   5.285714   300.0    C    Z
3   4.000000   400.0    X    X
4   5.000000   500.0    E    Y
5   5.285714   512.5    F    Z
6   7.000000   700.0    X    X
7   8.000000   512.5    H    Y
8   5.285714   900.0    I    Z
9  10.000000  1000.0    J    X